package org.example;

public class Main {
    public static void main(String[] args) {
        System.out.println();
    }
}
/*Статические методы отличаются от обычных тем, что они также привязаны к классу, а не к объекту.
* Создать экземпляр класса нельзя потому что в классе не описаны параметры для создания объектов.
* Вызвать метод calculateSquare() нельзя потому что он привязан к статическому классу, а к объекту нет.
* */
